{
  "sermons": [
    {
      "id": "d440276e-0ade-4620-a8cf-23c159af5216",
      "title": "Test 5",
      "speaker": "Stu",
      "date": "2025-03-17",
      "audiourl": "/api/file/d440276e-0ade-4620-a8cf-23c159af5216_compressed.mp3",
      "transcription": "Hello, good morning. You're gonna grab your sweets, take a seat. That'd be fantastic. I'm gonna stand here. So today we are kicking off a brand new sermon series on the topic of forgiveness, just as Ben has already said. Forgiveness is a word that you hear a lot in church. We talk a lot about the forgiveness that we receive from God through Jesus Christ. We talk a little bit more, well, we talk a bit about forgiving other people. And in the next four weeks or so, in the run-up to Easter, we are going to be doing a deep dive into what forgiveness is and how we can live a lifestyle of forgiveness just like Jesus taught us to. We're gonna look at the importance of receiving forgiveness. We're gonna look at how we can pursue a lifestyle of forgiveness. We're gonna hear some stories of the amazing power of forgiveness. But today we're gonna kick off by looking at how biblical forgiveness is fading, why we still need it, and then how we can walk in it. Gonna look at how biblical forgiveness is fading, why we still need it, and how we can walk in it. But before we get stuck in, would you join me in just praying to kick us off? Father in heaven, we thank you for Jesus. We thank you that the King of kings and Lord of lords died in our place, rose again in victory, and we get to live a life pursuing him. I pray in the name of Jesus and by the power of the Spirit, you would help us to pursue him every day and pursue his way for our life. We want to pursue a lifestyle that is honoring him and following his way. And we can't do that by any other means than by the power of your Spirit. And so Father, I pray that you would work amongst us to help us do that. Lord, I pray over the course of this series and as we look at this topic of forgiveness, that you would do a work on our hearts, that you would make us a people carved in your image, Lord God. Grow us in your likeness, I pray in Jesus' name. Okay, so we're going to start today by reading Matthew 18, verses 21 to 35. If you've got your Bibles with you, it might be helpful throughout today to be able to come back to it as we've read it once, but I'm going to read it out. The words will come up on the screens. Matthew 18, 21 to 35. Then Peter came up and said to him, so Jesus said to Jesus, Lord, how often will my brother sin against me and I forgive him? As many as seven times? Jesus said to him, I do not say to you seven times, but 77 times. Therefore, the kingdom of heaven may be compared to a king who wished to settle accounts with his servants. When he began to settle, one was brought to him who owed him 10,000 talents. And since he could not pay, his master ordered him to be sold with his wife and children and all that he had and payment to be made. So the servant fell on his knees imploring him, have patience with me and I will pay you everything. And out of pity for him, the master of that servant released him and forgave him the debt. But when that same servant went out, he found one of his fellow servants who owed him 100 denarii. And seizing him, he began to choke him saying, pay what you owe. So his fellow servant fell down and pleaded with him, have patience with me and I will pay you. He refused and went and put him in prison until he should pay the debt. When his fellow servants saw what had taken place, they were greatly distressed and they went and reported to their master all that had taken place. Then his master summoned him and said to him, you wicked servant, I forgave you all that debt because you pleaded with me. And should not you have had mercy on your fellow servant as I had mercy on you? And in anger, his master delivered him to the jailers until he should pay all his debt. So also my heavenly father will do to every one of you if you do not forgive your brother from your heart. Jesus doesn't mess around. Jesus was a revolutionary. He was a revolutionary. The teaching of Jesus revolutionized the world. No other person who has ever existed has had such a profound impact on how billions and billions of people over thousands of years have lived their lives. Nobody else in the world compares to the impact that Jesus has had. His teachings have provided the ethical framework that has shaped the history of the world. And one of the cornerstones of that ethical framework of his teaching is what he had to say on this topic of forgiveness. Jesus walked the earth 2000 years ago in the middle of the Roman Empire. The Roman Empire was a shame and honor culture where if you were wronged, if you were offended and hurt by someone, defending your honor was the ethical framework through which you made decisions, right? You sought revenge. You satisfied your honor. And into that context, Jesus dropped the bombshell of God's teaching on forgiveness. He went around saying things like, if you forgive others, then your father in heaven will forgive you. And forgive people who hurt you, not just seven times, but 77 times. And on the cross when he died, some of his last words were, father forgive them because they don't understand the magnitude of what they were doing. And as he's looking out over the people who have tortured him to death, those were his words. His teaching on forgiveness revolutionized the ethical framework of the world. Hannah Arendt, one of the most influential political theorists of the 20th century, not a Christian, said this, the discoverer of the role of forgiveness in the realm of human affairs was Jesus of Nazareth. The discoverer of the role of forgiveness in the realm of human affairs was Jesus of Nazareth. In 2025 in London, we live in the light of what Jesus taught about forgiveness. Our country has been shaped by it. As Christians, we are commanded to pursue forgiveness as a way of life. To follow Jesus is to take seriously his commandment to forgive others who have hurt us. The Bible is clear that forgiveness is good for us and it's good for the community around us, for us more broadly, collectively. And yet it's not always easy, is it? Just like Peter at the start of Matthew 18, the passage that I just read, the idea of forgiveness, pursuing genuine, heartfelt forgiveness from our heart can be hard. Perhaps even more than that, I think that in our moment in history, we come up against particular forces and particular barriers when it comes to pursuing a lifestyle of forgiveness because of the culture in which we live in. So what we're gonna do today is we're gonna look at three aspects of forgiveness to kick this series off. We're gonna look at, number one, the fading of forgiveness, the fading of forgiveness in our culture and society. Number two, we're gonna look at the need for forgiveness. And number three, we're gonna look at the dimensions of forgiveness. So let's start with the fading of forgiveness. Genuine Jesus-shaped forgiveness has never been easy, I don't think. But in our day and age, the very idea of forgiveness is fading in particular ways. I think there are at least, there's probably many more, but at least three factors in the fading of forgiveness in a city like ours in London in 2025, which I think is good to name front and center as having an impact in terms of how we think about this idea. The first is that in the past, forgiveness has been abused. In the past, the concept of forgiveness has been used to cover up injustice rather than actually addressing the wrong that has been done. And it's easy to think of examples, isn't it? The wife suffering domestic abuse at home at the hands of her husband who was advised to forgive and forget, meaning just stay quiet and don't make a fuss. We can easily imagine scenarios where poor advice and misunderstanding of what forgiveness really is has actually hurt people. Or even within institutions, perhaps even institutions like the church where those institutions don't want their reputation to be tarnished by the actions of their members and so things are just kind of swept under the carpet. This type of abuse of forgiveness, I think has undermined how we think about it. We can think that forgiveness is just a method of control when in reality, as we're gonna see in just a little bit, the opposite is true. It's a method of freedom, God allowing us to walk in freedom. So at the outset, I just wanna be super clear about what forgiveness is not. Forgiveness is not excusing sin. It's not simply accepting an excuse for sinful behavior and then carrying on as you were before. Forgiveness is not abandoning justice. Justice is challenging the person who has wronged you with a view to repentance and possibly reconciliation. And that can include the person enduring the consequences of their wrong actions, particularly if those actions have broken laws or have broken trust. Forgiveness is not returning to a position of immediate trust. Sometimes people think that forgiveness means that you should immediately resume the same level and intimacy of relationship with the person that has hurt us. The truth is that that may not be healthy for you. It may not be healthy for the person who has hurt you because of their sinful and destructive choices that may actually enable those further. That's not what forgiveness is. Trust has to be restored through a process at an appropriate speed and in response to genuine repentance and reconciliation. Forgiveness has been misshaped and abused in the past and I think that has undermined our belief in it and how we can engage in it. Second, we often tend to make people earn forgiveness. Because our secular culture has removed any idea of God from the equation of our lives, there is no longer in our collective consciousness a concept of a holy God seated on the throne of heaven who will judge all things and all people with truth and equity at the end of all things. There's no longer any sense of having to give an account for your life. There's no longer any guarantee that in the end justice will be done. And in order to satisfy that innate sense of justice that we have, we often slip into making people earn their forgiveness. We often slip into thinking that in order to be forgiven, someone should beyond any shadow of a doubt show that they have changed. They have to make complete restitution for all of their past mistakes. They have to compensate. They have to provide full reparation. And if they don't, in full, then forgiveness can't be offered. Forgiveness in this mindset is a transaction, something that is earned, not something that is given by grace. Make sense? Quick example. Do you remember this guy? Next slide. Oh, that's big. I need to minimize that in the future. This is Matt Hancock, former MP for Suffolk, West Suffolk, not East Suffolk, but never mind. And nobody gets that, don't worry. Former health minister during the COVID pandemic, right? He was forced to resign because he breached social distancing guidelines when he had an affair with one of his coworkers, big splash on the front of all the newspapers. Back in 2022, Matt Hancock courted a little bit more controversy by heading into the jungle, the I'm a celebrity jungle during his time when he was supposed to be sitting as an MP. If you're not aware of this show, I'm a celebrity, then well done. Maybe we can hang out a bit more because I reckon we'll probably get along. But on this show, I'm told, the public votes for different celebrities to face different tasks each week, various trials, right? They're called Bush Tucker trials. Basically, the least popular that you are, the more likely it is that you will be involved in these Bush Tucker trials. Matt Hancock went on this show and he obviously gets voted in to do all of the trials. He ended up doing six consecutive trials on the bounce. He's the least popular guy in the camp by a long way. He ate a fish eye taco, which is one of the trials that he had to do. He ate cockroaches with a blended cockroach dip. He ate various parts of animals that should never be ingested by human beings, and I'm certainly not gonna list them now. And on top of all of that, he also had to deal with his fellow celebrities, grilling him with questions whilst he's in the camp about what he did during the COVID pandemic and what the government did and didn't do and the decisions that were made. And at one point they asked him, why are you even here? Surely you knew coming onto this TV program that you would just get chosen to do all of the tasks all of the time. Surely you knew that would happen. Surely you knew that you would get grilled by us about the decisions that you made or that you didn't make. And Matt Hancock replied and he said this. Well, they said, why are you here? And he said, really, what I'm looking for is a bit of forgiveness. Really, what I'm looking for is a bit of forgiveness. He saw being on that show, doing all those horrible things, those horrible tasks, as a way of proving his humanity, of paying his debt, showing that he was really sorry, earning people's forgiveness. I think it's a very public example of where we often land in our culture and how we think about forgiveness. That forgiveness should only be earned and not freely given. That we can only forgive when they have done this and this and this and this and this. The biblical idea of forgiveness is fading because often we make people earn it. Finally, find a way that forgiveness is fading in our day and age in London in 2025. There is a rising trend in our society which considers forgiveness to be fundamentally flawed, to be fundamentally toxic. In this opinion, people would argue that if someone messes up, if they hurt people, then forgiveness shouldn't be an option, actually. Forgiveness is seen as a radically unjust way of oppressors maintaining power over their victims. To forgive would be to minimize the pain caused and simply just let people off, so don't forgive. Just focus on justice. This is the rise of council culture, right? Forgiveness isn't an option because it compromises their idea of justice, so we don't go there. And to be honest, I think that is a frightening prospect for any human being who knows that they are not perfect. And so because of factors like these, forgiveness is fading. It's been abused, I think we make people earn it, and also we're just trying to get rid of it, or deny it completely, cancel it. And yet, Jesus insists on it. He insists on it. Why? Because we need it. We need it individually, and we need it collectively. So let's dig into why, even though it's fading in our culture and our society, why do we still need this biblical concept of forgiveness? First, let's take a look at it as individuals. When we fail to forgive the people who hurt us, that failure to forgive can cause a root of bitterness to grow in your life. In Hebrews 12, verses 14 to 15, it says this. Strive for peace with everyone, and for the holiness without which no one will see the Lord. See to it that no one fails to obtain the grace of God, that no root of bitterness springs up and causes trouble, and by it, many become defiled. By not forgiving, you are allowing a root of bitterness to take hold in your life. You're allowing the actions of someone else to control you and control your feelings. Because when you stay in a place of unforgiveness, you hold on to anger, it can wind you up inside, you can't move on, it burdens you, right? Not the person that has hurt you, they're unaffected. Not the person that has hurt you, they're unaffected. When that root of bitterness grows, it hurts you. In the parable that I read earlier, the unforgiving servant ends up in prison, doesn't he, at the end? That's what it can be like when you don't forgive. The harm that someone has caused you grows into a root of bitterness that twists and contorts your life, robs you of joy, affects your ability to trust, loads of other negative things. Effectively, it's like we're living in a prison built by the pain that has been inflicted upon us. And the way that we step out of that prison is to forgive from the heart, like Jesus told us to. To walk in freedom and wholeness as individuals, we need to forgive people from the heart. Corrie ten Boom, quick story, Corrie ten Boom was a Dutch Christian whose family hid Jews from the Nazis during World War II. She and her sister Betsy were caught doing this and they were sent to Ravensbrück concentration camp during the war, where, unfortunately, Betsy died, but Corrie survived. In 1947, two years later, Corrie ten Boom was doing a preaching tour, a speaking tour in Germany. She was going around in Germany preaching the gospel, telling people that their sins could be forgiven and separated from them as far as the east is from the west. She was going around speaking publicly about that. And at the end of one of the particular meetings that she did, a man walked towards her who she recognized. The man had been a concentration camp guard at Ravensbrück. He'd been there, and he'd seen her, and he'd seen her sister. He didn't recognize her. And he approached her and he told her that he had been in a concentration camp guard and that he had turned to Jesus for the forgiveness of all of the cruel and awful things that he had done. And he stuck out his hand. He offered like a handshake to Corrie ten Boom and said, thank you so much for preaching the gospel tonight. And Corrie kept her hand in her pocket, unmoving. Her thoughts went to her sister, Betsy, the horror of the camp. Her thoughts went to an image of this guy in his uniform, as it was back then. Her hand stayed in her pocket. But then she remembered how many people that she knew who had been crippled by bitterness. She also remembered that forgiveness is not an emotion, but a choice, an act of the will. A choice of obedience to follow the way of Jesus in your life. Not something that you do because you feel like it, but because you choose to follow him and you trust him. And so she prayed silently, and this is what she says happened next. She says, so woodenly, mechanically, I thrust my hand into the one stretched out to me. And as I did, an incredible thing took place. The current started in my shoulder. It raced down my arms, sprang into our joined hands, and then this healing warmth seemed to flood my whole being, bringing tear to my eyes. I forgive you, brother, I cried. With all of my heart, I had never known God's love so intensely as I did then. Later on, she would go on to say, forgiveness is the key which unlocks the door of resentment and the handcuffs of hatred. It breaks the chains of bitterness and the shackles of selfishness. Corrie ten Boom's story is extraordinary, right? It's extraordinary. Sometimes forgiveness can be like that. To be honest, though, more often than not, I think, in fact, in the vast majority of cases, forgiveness isn't just a one-time moment where you feel a supernatural explosion of God's love. More often than not, it's a process of forgiving once, and then again, and when the pain resurfaces, forgiving again, and then allowing the process and the power of forgiveness to heal over time the wound that you are carrying because of the hurt that you've experienced. It can happen like Corrie ten Boom, but more often than not, it's a process. It's a process of allowing the power of God to heal the wound that you're carrying. Forgiveness is how we stop that bitterness at the hurt we have experienced dominating our lives, shaping our relationships, affecting how we live. Failure to forgive can twist us up into resentment and imprison us emotionally. That's what Scripture says. So we need to forgive individually for our own sake. We also need forgiveness collectively, don't we? The Bible is more than just individual therapy. Forgiveness lays the groundwork for reconciliation and restoration in communities and society and families and relationships more broadly. History is littered with examples of societies torn apart by vengeance and unforgiveness, from places like the Balkans in Eastern Europe to Rwanda in Africa. And we see even this playing out on the streets of London today, 2025. We live in a society where young people, young men in particular, are shooting, stabbing, losing their lives in revenge for perceived slights rather than forgiving in order to maintain some illusion of status and honour within the groups that they run in. Vengeance and all of its awful consequences are pursued. And the result is a tearing at the fabric of families, a tearing at the fabric of communities, our neighbourhoods, our city. Forgiveness is not just necessary as individuals, it's also necessary as a community, collectively. We need it to bring about healing and reconciliation, to stop the escalating power of revenge in our city and in our communities. We need forgiveness. So we've looked at how forgiveness is fading, we've looked at how we still need forgiveness. Now I want to turn to what I'm going to call the dimensions of biblical forgiveness. And we're going to use the parable that I read out at the beginning to explore the dimensions of biblical forgiveness. I've got these from a guy called Tim Keller, who's got a great book on forgiveness, and also another writer called David Powlison. If you want to read those later, I'd encourage you to, they're really helpful. The dimensions of forgiveness that I want to explore as we close are the vertical, the internal, and the horizontal. Three dimensions of biblical forgiveness. Really important for us to understand what biblical forgiveness looks like. So number one, vertical forgiveness. Vertical forgiveness is what we receive from God through faith in Jesus Christ. This is the power, the starting place, for pursuing a path of biblical forgiveness in your life. If you miss the vertical dimension, you will not have the resources to make it further in a lifestyle of forgiveness. In vertical forgiveness, we recognize our spiritual debt before a holy God. Our sin, our failure, our mistakes, every imperfection. And we are forgiven of that debt. The slate is wiped clean. The debt is paid by Christ in our place. And in return, amazingly, He doesn't just get rid of that debt, we receive spiritual wealth. We are given a new identity in Christ. We are co-heirs with Him in the kingdom of God. We are sons and daughters. We receive this incredible mercy and grace and love. That's the grace-filled gospel dynamic of vertical forgiveness from God. It changes our lives, right? It's the good news. In the parable of the unforgiving servant, the servant was forgiven an enormous debt, 10,000 talents. An ordinary man back then would earn about one talent per year. An ordinary working class guy, one talent per year. This guy owed 10,000 to the king. Translate that to London in 2025. I looked it up. The ONS, Office for National Statistics, tells us, he loves this, tells us that the average wage in London in 2025 is 47,000 pounds. And so, let's multiply it out by 10,000. This guy owed 470 million pounds worth to the king. That's a big debt. But the numbers aren't actually even the main point of this. The talent was the highest unit of currency within the Roman Empire. And Jesus is using talent on purpose. 10,000 is the highest number in the Greek language that had a word to describe that unit. And so, you've got the highest unit of currency and the highest number that has a word in the ancient Greek language. And Jesus is using those together on purpose to describe an immeasurable debt. 470 million doesn't even come close to what Jesus is trying to describe. A debt that the servant could not ever have paid back to the king. And the servant cries out to the king for mercy, and the king absorbs the cost of that debt himself and releases the man. This is the vertical forgiveness that we experience from God. An immeasurable debt. And he absorbs the cost and he releases us. More than that, he gives us spiritual wealth beyond anything that we can possibly imagine. We are forgiven. The debt of our sin is wiped away. Jesus absorbs the cost. We are set free. That's the forgiveness of the gospel. The vertical forgiveness that is critical in biblical forgiveness. And from that place, from having the power of that vertical forgiveness from God, that should equip us with what we need for the next dimension of biblical forgiveness, the ability to forgive others internally from our heart. And this is where Jesus warns us not to be like the servant who was unable to translate that vertical forgiveness into an internal forgiveness of his fellow servant, right? Jesus warns us, don't be like that guy. So what does internal forgiveness look like? I want to use this parable to give us a few critical parts of what internally forgiving from the heart actually looks like. I think we often talk in church about forgiving other people, but we don't actually talk about what that looks like in reality. What words do I say? So first, you honestly name the hurt. This is how you forgive someone from the heart. You honestly name the hurt and its effect on you. In the parable, in verse 24, the servant with this colossal debt was brought before the king. The king wanted to settle his accounts. The debt wasn't hidden away. The king wanted to deal with it. It wasn't excused. It was brought into the light and dealt with. Honestly, we need to do the same when we forgive from the heart. We have to identify the hurt that has been inflicted on us and how it made us feel. Sometimes we skip past that. We skip past the real impact of how whatever has been done to us makes us feel what we actually need to forgive because we don't really want to look at it. We don't really want to engage because it's painful. But if you do that, you're not actually forgiving. You're saying, I forgive you, but you're not actually reckoning with the hurt that you feel. To truly forgive in your heart, you need to say, and I'm going to give you the words, I choose to forgive XXX you for that whatever it is. I choose to forgive you for that betrayal, let's say, because it made me feel worthless, lonely, whatever it is. I choose to forgive you because of this, because it made me feel this. You start with honestly naming the hurt and how it made you feel, the impact it's had on you. Then in verse 27, we see the king having pity on the servant. To have pity on someone is to do the hard work of seeing the other person's situation. For us as people who have received the vertical forgiveness of God, that means identifying with the weakness and the failure of the person who has hurt us. They are flawed and broken and have hurt us. I am flawed. I am broken. I have hurt people. And this isn't excusing the pain that they have caused or minimizing it. It's not saying it doesn't matter. It's recognizing that they are a fellow sinner in the need of the grace of God. So we see them how they really are. Step three, in verse 27, the king absorbs the cost of the debt himself and gives up his right to revenge and releases the servant. We too, when we are forgiving someone from the heart, have to give up on revenge and absorb the cost of what has hurt us. When we forgive, we have to let the person who has hurt us off our hook and hand them to the Lord of the universe, who is a God of justice and who will do the right thing. That's not saying that what they have done is right or is okay. It's not saying that they shouldn't face the consequences for what they have done. If they've broken laws, then they should face the consequences of that. If they've broken your trust, there may be consequences for that. It's saying, I'm not going to pursue revenge. I'm handing over you to the judgment of God. I'm going to allow him to pursue justice because I know that one way or the other, justice will be done. Either Jesus will take the burden of your sin or you will. Justice will be done. And so we take them off our hook and we give them over to God. And we mustn't be naive about the cost of that. When we do that, when we take somebody off our hook and give up our right to revenge, there's still an emotional cost to that. You are absorbing the emotional cost of the sin that has hurt you. Just like the king absorbed the cost of his servant's 470 million pound debt. When we forgive someone, give up our instinct for revenge, there's an emotional cost to us. And I know that doesn't sound very attractive. But the truth is, you're carrying that cost anyway. If someone has hurt you, you are absorbing the emotional cost of that anyway. Otherwise, you wouldn't need to forgive them in the first place. You're walking around with that. The real choice is whether you absorb that cost in the bondage of bitterness and allow that wound to remain open for a long time, or instead whether you allow the healing power of forgiveness to start the process of your own healing. And so you say, I choose to forgive you, X, for betraying me because it made me feel whatever, worthless, lonely. I let you off. I hand you over to God and I release you. That's how you pray to forgive someone from the heart, according to this parable. Quick story. Hashim Garrett, at the age of 15, was deeply involved in the gangs of Brooklyn, New York, when he was shot six times and left paralyzed from the waist down. When he was laid up in the hospital, he was consumed with thoughts of revenge, on how he was going to get his own back, get vengeance on the guy who shot him. But when he was lying on the pavement after being shot, he had instinctively called out to God for help. And to his surprise, he had felt an overwhelming sense of peace as he was lying there as the ambulance crew were helping him. During his rehabilitation, those thoughts of revenge started to wane away. And he realized that if he took revenge on the kid who shot him, why should God not pay him back for all the stuff that he had done? Six months prior to him being shot, Hashim himself had shot somebody just because he had been told to by a fellow gang member. He realized he couldn't feel superior to the person who had shot him. He said this, In the end, I decided to forgive. I felt God had saved my life for a reason that I had better fulfill that purpose. And I knew I could never go back out there and harm someone. I was done with that mindset and the life that goes with it. I came to see that I had to let go and stop hating. From that place of internally forgiving the person who has hurt you, not only do you start to uproot the seed of bitterness that can twist and can contort your life, you also lay the groundwork for the final dimension of forgiveness that I'm going to talk about today, the horizontal, the path of reconciliation. When you forgive internally from the heart in a way that is empowered by the vertical forgiveness you receive from God, it leads to the possibility of reconciliation. In the parable, the king lets his servant go. He was made free. The debt has been named, the cost absorbed, and revenge not taken. And the servant and king enter into a restored relationship. When you forgive from the heart, empowered by the forgiveness that you have received from God, it's possible to pursue reconciliation with people who have wronged you. And of course, that final reconciliation may not always happen, may not always be possible. It depends on the reaction and the repentance and the attitude of the people that you are forgiving. Just like we see in this story, the servant isn't truly repentant, right? He's unchanged by this vertical forgiveness shown to him. And so he doesn't really live in the good of it. But true biblical forgiveness paves the way for the possibility of reconciliation and restoration. Biblical forgiveness is good for the individual, but it doesn't just stay there. It's not merely therapeutic. It's not merely individual. It breaks out and can be the force that heals relationships, families, communities. We spent the last month or so looking at different types of relationships, right? Friendships, dating relationships, marriages, parenting. Forgiveness is critical to the healthy functioning of all of those relationships. It is the applied power of the Gospel to the relationships that you have with the people around you in your life. It can restore, it can repair, it can heal if we choose to let it, if we choose to follow the way of Jesus in our life. And so, you have three dimensions of biblical forgiveness. The vertical, the internal, and the horizontal. As followers of Jesus, we are called to pursue forgiveness in our lives, to forgive those who hurt us. Not to abuse forgiveness, not to make people earn forgiveness, or even to deny forgiveness as being a good thing. But to apply the forgiveness that we have received from God through the Gospel of Jesus into our lives and our relationships with other people. When we do that, when we live like that, it's good for us. It stops the root of bitterness taking hold in our life. That can twist us up, make us angry, resentful. Something that we carry around as an open wound into the relationships that we have. It's also good for us as a community. And in our relationships, it paves the way for reconciliation and healing, restoration, for patience, for stories of redemption, change lives. Pursuing a lifestyle of forgiveness is a key part of following Jesus. And as we go on a journey over the next few weeks, my prayer is that God does something within us, does something new within us, where we learn this and then apply it and we see the fruit of it in amazing ways. In our relationships individually, in our relationships within the church, in how we conduct ourselves in our city. We want to be a people who follow the way of Jesus. To start as a way of kind of responding to this today, we're going to take communion together. We're going to take communion and we're going to allow, we want to ask, I'm going to ask God for that vertical power of his forgiveness and grace. To truly shape us, mold us, do a work within us at the start of this series on forgiveness. Does that make sense? So why don't we all stand? We're going to take communion together. If the band could come up, that would be great. Why don't we start making a move and getting your bread and your wine and then I'll draw us back together and we can pray together and take communion. This is a meal for followers of Jesus. If you're here as a visitor, as a guest, feel free to just let this one pass you by. Just observe what's going on, maybe have a moment of quiet. This is a meal for people who have put their faith in Jesus. Yeah, feel free to come around the back of the tables, there's lots of room. We'll be queuing for ages if we're too polite about it. We're going to take communion. We're going to take communion. We're going to take communion. We're going to take communion. We're going to take communion. We're going to take communion. We're going to take communion. We're going to take communion. We're going to take communion. We're too polite about it. Just wait for everybody to get their seats. Okay, great. Will you pray with me as we take this bread and this wine together? Father in heaven, we thank you for the forgiveness that you offer us through Jesus, his cross, his death and his resurrection. We are so incredibly grateful for our debt that was immeasurable. That more than 470 million, that incredible debt that we couldn't ever perform our way out of. Lord, you absorbed the cost yourself in love. And you not only took away, you wiped the slate clean, but you say, I'm going to bless you with immeasurable riches in Christ. Lord, we thank you that that's how we stand before you this morning. We stand not as paupers, not in poverty, spiritual poverty, but in spiritual wealth because of everything that Jesus has poured into our life. And Lord God, from that position of being spiritually wealthy, spiritually victorious, overcome us in Christ. Lord, I pray we want to help us to pursue a lifestyle of radically following Jesus. And in this way in particular, in how we forgive other people. Lord, I pray for a release of the power of forgiveness in our lives, in our life as a community. That people would be amazed by the peace and the grace and the restoration and the reconciliation that happens in us through the power of forgiveness that is empowered by the cross of Christ. Lord, I pray that you would do that in Jesus name. We remember all that you have done as we eat the bread that symbolizes your body broken and the wine symbolizing your bloodshed. We thank you, Lord Jesus. Amen.",
      "transcriptionstatus": "completed",
      "created_at": "2025-03-17T18:29:29.865Z",
      "updated_at": "2025-03-17T21:48:43.401Z",
      "has_snippets": true
    },
    {
      "id": "0981b1c4-a397-4008-a2bf-770bfbb7ced8",
      "title": "forgiveness 1/3",
      "speaker": "Stu",
      "date": "2025-03-17",
      "audiourl": "/api/file/0981b1c4-a397-4008-a2bf-770bfbb7ced8_compressed.mp3",
      "transcription": null,
      "transcriptionstatus": "failed",
      "created_at": "2025-03-17T21:25:30.361Z",
      "updated_at": "2025-03-17T21:49:12.838Z",
      "transcription_error": "fetch failed"
    }
  ]
}